
## Plan Result (sendgrid-data-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/53753)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9
* Replace
  * aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_api_gateway_deployment.apigateway-lambda_api-gateway-deployment_3AF9B512 must be replaced
+/- resource "aws_api_gateway_deployment" "apigateway-lambda_api-gateway-deployment_3AF9B512" {
      ~ created_date  = "2024-02-21T15:54:40Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:996905175585:1oyn6teaa0/" -> (known after apply)
      ~ id            = "rtl6ck" -> (known after apply)
      ~ invoke_url    = "https://1oyn6teaa0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "deployedAt"   = "1708530845250" -> "1708531168759"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.apigateway-lambda_api-gateway-stage_E95B0DF9 will be updated in-place
  ~ resource "aws_api_gateway_stage" "apigateway-lambda_api-gateway-stage_E95B0DF9" {
      ~ deployment_id         = "rtl6ck" -> (known after apply)
        id                    = "ags-1oyn6teaa0-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"8e6f3fe3-bf02-49f3-9ea8-248cf9aa0598","JobName":"sendgrid-data_infrastructure_plan_prod","PRNumber":192,"Program":"tfcmt","SHA1":"43405350031b3004d9ff7838d78ce95df9dab41f","Target":"sendgrid-data-cdk","Vars":{}} -->